---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FramingShapeClassification
source: html/86b16798-b04c-a064-1403-28aff4f23f64.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FramingShapeClassification Property

"Framing Shape"

## Syntax (C#)
```csharp
public static ForgeTypeId FramingShapeClassification { get; }
```